// 시간 스택을 쌓을 변수를 지정해줍니다.
// 콤보 스택을 쌓을 변수를 지정해줍니다.

window.addEventListener('keydown', e => {
    /*
    키를 눌렀을 때 작용하는 코드
    */
});

window.addEventListener('keyup', e => {
    /* 
    키를 땠을 때 작용하는 코드 
    */
});

function start() {
    // 스타트 버튼을 눌렀을 떄 스타트 버튼이 사라지는 코드
    // 노래가 재생되는 코드
    // 시간을 밀리초로 바꿔주는 코드 

    setInterval(() => {
        // 현재 시간을 밀리초로 바꿔줍니다.
        for () {
            if () {
                // 노트를 생성하고 일정시간이 지나면 노트가 사라지게 합니다.
            }
        }
    }, 1);
}

function isJudge(track) {
    // 시간을 밀리초로 바꿉니다.
    for () {
        if () {
            if () {
                if () {
                    // 지정해둔 시간에 노트를 타이밍 맞게 치면 콤보가 추가되게 합니다.
                } else {
                    // 타이밍에 맞게 치지 못하면 콤보가 0이 되게 합니다.
                }        
            }
        }
    }
}